run/ghost/moving_wall/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 1;

boundaryField
{
    wall
    {
        type            fixedValue;
	#include "int.T"
    }
    symmetry
    {
        type            symmetryPlane;
    }
    left
    {
    	type 		cyclic;
    }
    right
    {
    	type 		cyclic;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
