run/ghost/moving_wall/0/int.T
value           nonuniform List<scalar>
100
(
0.500247
0.502219
0.506156
0.512042
0.519853
0.529560
0.541123
0.554497
...
);
