run/ghost/moving_wall/0/int.U
value           nonuniform List<vector>
100
(
(1.173487 0 0)
(1.263792 0 0)
(1.354353 0 0)
(1.445320 0 0)
(1.536806 0 0)
(1.628881 0 0)
(1.721556 0 0)
(1.814784 0 0)
...
);
